---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralInstanceUsageFilter
source: html/07d24cca-6ea9-e8d0-af56-a59fd5bd9149.htm
---
# StructuralInstanceUsageFilter Methods

Applies the filter to a given element.